// 파트장 명단
window.PART_LEADERS = ['조경훈', '김종현', '김종오', '김흥섭', '김홍섭', '강선희', '김연섭', '이종민', '이종인', '정재문'];

// 좌석 데이터
window.SEAT_DATA = [
  // 본부장 & 공용
  {id: "Test", name: "Test실", team: "공용", x: 30, y: 700},
  {id: "1475", name: "서강석", team: "본부장", x: 30, y: 790},
  
  // 1~2열
  {id: "1224", name: "박준형", team: "상담", x: 100, y: 250}, {id: "1609", name: "김동혁", team: "상담", x: 100, y: 340}, {id: "1255", name: "김성훈", team: "운영혁신", x: 100, y: 430}, {id: "1413", name: "신규", team: "빈자리", x: 100, y: 520}, {id: "9901", name: "김범", team: "운영혁신", x: 100, y: 610}, {id: "1479", name: "이동은", team: "기획", x: 100, y: 700}, {id: "1401", name: "서성훈", team: "팀장", x: 100, y: 790},
  {id: "1483", name: "김기훈", team: "상담", x: 170, y: 250}, {id: "1285", name: "이소연", team: "상담", x: 170, y: 340}, {id: "1788", name: "장병용", team: "상담", x: 170, y: 430}, {id: "1712", name: "장성호", team: "솔포인트", x: 170, y: 520}, {id: "1137", name: "박남호", team: "솔포인트", x: 170, y: 610}, {id: "1369", name: "강선희", team: "솔포인트", x: 170, y: 700},
  
  // 3~4열
  {id: "1485", name: "이장규", team: "상담", x: 260, y: 250}, {id: "1797", name: "김지연", team: "상담", x: 260, y: 340}, {id: "9903", name: "김상민", team: "상담", x: 260, y: 430}, {id: "1364", name: "김윤호", team: "상담", x: 260, y: 520}, {id: "8625", name: "김지영", team: "상담", x: 260, y: 610}, {id: "1280", name: "조경훈", team: "상담", x: 260, y: 700},
  {id: "1437", name: "김영필", team: "오토", x: 330, y: 250}, {id: "1448", name: "김세희", team: "오토", x: 330, y: 340}, {id: "1978", name: "홍영기", team: "오토", x: 330, y: 430}, {id: "1880", name: "박지건", team: "오토", x: 330, y: 520}, {id: "1489", name: "남진아", team: "오토", x: 330, y: 610}, {id: "1461", name: "조용진", team: "오토", x: 330, y: 700}, {id: "1979", name: "김종현", team: "오토", x: 330, y: 790},
  
  // 5~6열
  {id: "1814", name: "윤호영", team: "오토", x: 420, y: 250}, {id: "1741", name: "김선혜", team: "오토", x: 420, y: 340}, {id: "1642", name: "김준석", team: "오토", x: 420, y: 430}, {id: "1464", name: "이성학", team: "오토", x: 420, y: 520}, {id: "1288", name: "김보령", team: "오토", x: 420, y: 610}, {id: "1442", name: "박용탁", team: "오토", x: 420, y: 700}, {id: "1753", name: "김원규", team: "재무", x: 420, y: 790},
  {id: "1480", name: "조성인", team: "오토", x: 490, y: 250}, {id: "8680", name: "표동수", team: "오토", x: 490, y: 340}, {id: "1465", name: "김현석", team: "오토", x: 490, y: 430}, {id: "1317", name: "김예린", team: "오토", x: 490, y: 520}, {id: "1825", name: "박대윤", team: "오토", x: 490, y: 610}, {id: "1537", name: "김현우", team: "오토", x: 490, y: 700}, {id: "1477", name: "정재문", team: "재무", x: 490, y: 790},
  
  // 7~8열
  {id: "1351", name: "이하나", team: "재무", x: 580, y: 250}, {id: "1803", name: "심혜진", team: "재무", x: 580, y: 340}, {id: "1414", name: "유미숙", team: "재무", x: 580, y: 430}, {id: "1375", name: "김우철", team: "재무", x: 580, y: 520}, {id: "8892", name: "김연섭", team: "통합메시지", x: 580, y: 610}, {id: "1380", name: "이현지", team: "발급", x: 580, y: 700}, {id: "OA", name: "기동OA", team: "공용", x: 580, y: 790},
  {id: "1866", name: "이승인", team: "개발전담", x: 650, y: 250}, {id: "1188", name: "방성원", team: "개발전담", x: 650, y: 340}, {id: "1861", name: "시일교", team: "통합메시지", x: 650, y: 430}, {id: "1290", name: "박재훈", team: "통합메세지", x: 650, y: 520}, {id: "1292", name: "강윤지", team: "통합메세지", x: 650, y: 610}, {id: "1310", name: "임태욱", team: "통합메세지", x: 650, y: 700}, {id: "1293", name: "홍성민", team: "통합메세지", x: 650, y: 790},
  
  // 9~10열
  {id: "1331", name: "황병용", team: "개발전담", x: 740, y: 250}, {id: "1332", name: "이준상", team: "개발전담", x: 740, y: 340}, {id: "1268", name: "정강호", team: "마이카", x: 740, y: 430}, {id: "1446", name: "김지민", team: "마이카", x: 740, y: 520}, {id: "1942", name: "변상현", team: "마이카", x: 740, y: 610}, {id: "1878", name: "임형진", team: "마이카", x: 740, y: 700}, {id: "1726", name: "김경원", team: "발급", x: 740, y: 790},
  {id: "1946", name: "조성훈", team: "개발전담", x: 810, y: 250}, {id: "8884", name: "박은혜", team: "올댓", x: 810, y: 340}, {id: "8885", name: "강용선", team: "올댓", x: 810, y: 430}, {id: "8886", name: "이민호", team: "올댓", x: 810, y: 520}, {id: "8658", name: "함덕훈", team: "홈페이지", x: 810, y: 610}, {id: "8687", name: "이선아", team: "홈페이지", x: 810, y: 700}, {id: "1778", name: "이현경", team: "홈페이지", x: 810, y: 790},
  
  // 11~12열
  {id: "1943", name: "김찬수", team: "개발전담", x: 900, y: 250}, {id: "1865", name: "김규동", team: "개발전담", x: 900, y: 340}, {id: "1258", name: "이나현", team: "홈페이지", x: 900, y: 430}, {id: "1945", name: "박종원", team: "홈페이지", x: 900, y: 520}, {id: "1478", name: "용원중", team: "홈페이지", x: 900, y: 610}, {id: "8686", name: "김성우", team: "홈페이지", x: 900, y: 700}, {id: "1266", name: "명보민", team: "홈페이지", x: 900, y: 790},
  {id: "1870", name: "최승아", team: "개발전담", x: 970, y: 250}, {id: "1947", name: "유현규", team: "개발전담", x: 970, y: 340}, {id: "1842", name: "박재환", team: "홈페이지", x: 970, y: 430}, {id: "1394", name: "김혜경", team: "홈페이지", x: 970, y: 520}, {id: "1443", name: "이영주", team: "홈페이지", x: 970, y: 610}, {id: "7499", name: "최호영", team: "홈페이지", x: 970, y: 700}, {id: "1333", name: "신정은", team: "홈페이지", x: 970, y: 790},
  
  // 13~14열
  {id: "1734", name: "최현철", team: "데이타비즈", x: 1060, y: 250}, {id: "1730", name: "유지은", team: "데이타비즈", x: 1060, y: 340}, {id: "1863", name: "박다은", team: "개발전담", x: 1060, y: 430}, {id: "1934", name: "오선영", team: "홈페이지", x: 1060, y: 520}, {id: "1138", name: "임진철", team: "홈페이지", x: 1060, y: 610}, {id: "1875", name: "홍지연", team: "홈페이지", x: 1060, y: 700}, {id: "8048", name: "이시원", team: "홈페이지", x: 1060, y: 790},
  {id: "", name: "공석", team: "공석", x: 1130, y: 250}, {id: "1735", name: "박선용", team: "데이타비즈", x: 1130, y: 340}, {id: "1366", name: "조철현", team: "전자문서", x: 1130, y: 430}, {id: "1773", name: "정종규", team: "전자문서", x: 1130, y: 520}, {id: "8181", name: "김종오", team: "홈페이지", x: 1130, y: 610}, {id: "8180", name: "박동영", team: "홈페이지", x: 1130, y: 700}, {id: "8627", name: "김홍섭", team: "홈페이지", x: 1130, y: 790},
  
  // 15~16열
  {id: "1896", name: "민광진", team: "모바일(PLCC)", x: 1220, y: 250}, {id: "1897", name: "이봉원", team: "모바일(PLCC)", x: 1220, y: 340}, {id: "1476", name: "임영우", team: "모바일", x: 1220, y: 430}, {id: "1131", name: "진은성", team: "모바일", x: 1220, y: 520}, {id: "1869", name: "김도현", team: "모바일", x: 1220, y: 610}, {id: "8144", name: "박증원", team: "모바일", x: 1220, y: 700}, {id: "1132", name: "임지우", team: "모바일", x: 1220, y: 790},
  {id: "1607", name: "윤학민", team: "모바일", x: 1290, y: 250}, {id: "7547", name: "송효범", team: "모바일", x: 1290, y: 340}, {id: "1955", name: "김은정", team: "모바일", x: 1290, y: 430}, {id: "8016", name: "서은빈", team: "모바일", x: 1290, y: 520}, {id: "8159", name: "김성민", team: "모바일", x: 1290, y: 610}, {id: "8191", name: "김지수", team: "모바일", x: 1290, y: 700}, {id: "1841", name: "권예림", team: "모바일", x: 1290, y: 790},
  
  // 17열 
  {id: "1316", name: "한민지", team: "모바일", x: 1380, y: 250}, {id: "1315", name: "김지해", team: "모바일", x: 1380, y: 340}, {id: "1811", name: "유지원", team: "모바일", x: 1380, y: 430}, {id: "1294", name: "조호영", team: "모바일", x: 1380, y: 520}, {id: "8182", name: "임종완", team: "모바일", x: 1380, y: 610}, {id: "8353", name: "승무준", team: "모바일", x: 1380, y: 700}, {id: "8183", name: "이종민", team: "모바일", x: 1380, y: 790},
  
  // 디스커버 존 
  {id: "8727", name: "김재용", team: "디스커버", x: 1060, y: 20}, {id: "8729", name: "정상은", team: "디스커버", x: 1140, y: 20}, {id: "8712", name: "김찬연", team: "디스커버", x: 1220, y: 20}, {id: "7167", name: "남주석", team: "디스커버", x: 1300, y: 20},
  {id: "8782", name: "김현진", team: "디스커버", x: 1060, y: 110}, {id: "1793", name: "전진", team: "디스커버", x: 1140, y: 110}, {id: "8713", name: "이동표", team: "디스커버", x: 1220, y: 110}, {id: "8190", name: "장진역", team: "디스커버", x: 1300, y: 110}, {id: "8168", name: "신재준", team: "디스커버", x: 1380, y: 110}
];

